export const checklistDocumentNames: Record<string, string> = {
  '1': 'Лицензия на осуществление деятельности по эксплуатации взрывопожароопасных и химически опасных производственных объектов I, II и III классов опасности',
  '2': 'Свидетельство о регистрации в государственном реестре ОПО, включая сведения характеризующие ОПО',
  '3': 'Технологический регламент объектов опасных производственных объектов',
  '4': 'План мероприятий по локализации и ликвидации последствий аварий на опасном производственном объекте',
  '5': 'Положение о производственном контроле за соблюдением требований промышленной безопасности на опасных производственных объектах',
  '6': 'Журнал учета аварий и инцидентов на ОПО',
  '7': 'Страховой полис страхования гражданской ответственности владельца опасного объекта за причинение вреда в результате аварии на опасном объекте',
  '8': 'Приказ о назначении ответственного лица за исправное состояние и безопасную эксплуатацию сосудов',
  '9': 'Приказ о назначении ответственного лица за осуществление производственного контроля и соблюдение требований промышленной безопасности на опасном производственном объекте',
  '10': 'Паспорт сосуда заводской (удостоверение о качестве монтажа, сертификат соответствия, сборочный чертёж и схема включения сосуда, расчёт на прочность)',
  '11': 'Инструкция по монтажу и эксплуатации',
  '12': 'Паспорта на предохранительные клапаны',
  '13': 'Паспорта на запорную арматуру',
  '14': 'Документация на контрольно-измерительные приборы',
  '15': 'Ремонтная (исполнительная) документация',
  '16': 'Заключение экспертизы промышленной безопасности',
  '17': 'Акты проведения УЗТ',
};









